{
  "slug": "meteor-js",
  "title": "Introduction to Meteor.js: Why and How",
  "description": "If you're interested in web development at all and haven't yet played around with Meteor, then this talk is for you. Even if you don't plan on using it in production immediately, the web world is changing, and meteor is creating new paradigms that are important to pay attention to. Unlike most JavaScript frameworks, Meteor runs on the client _and_ the server. Combine that with their de facto database, MongoDB, and it means you can write your entire application from client to server to database all in a single language. Oh, and did I mention that the database (Mini-Mongo) also runs on the client?\n\nMeteor uses the publish and subscribe model to automatically send changes from the database to your client, where the rendering template engine will figure out what the new data would look like, compare with the current info to change the fewest possible DOM elements, and automatically update it on the fly.\n\nIt comes bundled with a bunch of other amazing tools, like hot code deploys without logging users out of the system, easy one step builds into hybrid mobile applications for Android and iOS, command-line tools to help development, and one of the most active development communities I've ever seen. It's no wonder why it has raised an unprecedented $31 million (with an M!) in venture capital funding.\n\nThis talk will go into the basics of building a Meteor application, and how you can start developing and deploying Meteor applications today. In fact, we'll build and deploy a live Meteor app during the talk (then I'll figure out what to do with the remaining 55 minutes).",
  "_links": {
    "self": { "href": "/2015/sessions/meteor-js" },
    "event": { "href": "/2015/" },
    "space": { "href": "/2015/spaces/room-1" },
    "timePeriod": { "href": "/2015/time-periods/0900" },
    "level": { "href": "/2015/levels/100" },
    "speaker": [
      { "href": "/2015/speakers/kyle-mitofsky" }
    ]
  }
}
