{
  "slug": "civic-hacking",
  "title": "Civic Hacking: Improving Communities Through Technology",
  "description": "Jake Levitas, Mayor's Innovation Fellow at City and County of San Francisco, describes civic hacking as \"people working together quickly and creatively to make their cities better for everyone.\" This session will explore the civic hacking movement nationally and locally. Code for America is a national organization that is working to improve government by transforming how we think about citizenship. We'll take a look at the work Code for America is doing through its fellowship, accelerator, and brigade programs. You'll learn how you can join the civic hacking movement.\n\nWe'll also take a look at what civic hackers are doing right here in Vermont through Code for BTV, a Code for America Brigade. We'll look at some fun projects such as Lakecraft, an educational tool that engages youth and adults in science by gamifying the Lake Champlain Basin using open data and a custom modification to Minecraft. We'll see how the Vermont Digital Economy Project is working with Code for BTV volunteers to make Vermont communities more resilient by building WordPress websites for non-profit organizations. We'll talk about how coders and designers are working with Big Heavy World to promote and preserve Vermont-made music.\n\nWe'll conclude by taking a look at the Civic Cloud, an ambitious local project that aims to make cloud computing resources available for non-commercial Internet applications with a focus on public, educational, and government access. Hundreds of applications could be hosted in the Civic Cloud as an ecosystem of civic applications are developed. We'll explore how the Civic Cloud serves a unique purpose as compared to commercial cloud service providers.",
  "_links": {
    "self": { "href": "/2013/sessions/civic-hacking" },
    "event": { "href": "/2013/" },
    "track": { "href": "/2013/tracks/biz-meta" },
    "space": { "href": "/2013/spaces/room-2" },
    "timePeriod": { "href": "/2013/time-periods/1615" },
    "level": { "href": "/2013/levels/100" },
    "speaker": [
      { "href": "/2013/speakers/bradley-holt" },
      { "href": "/2013/speakers/jason-pelletier" }
    ]
  }
}
