{
  "slug": "writing-about-code",
  "title": "Writing About Code",
  "description": "Docendo discimus (\"by teaching, we learn\") — Seneca the Younger\n\nThere are many reasons to write about code: to share our enthusiasm for programming, to market a new product, to teach new programmers… let's face it, maybe to promote our own abilities or even make a buck. But one thing is for certain: when you try to write about what you think you know, it puts to a test how well you really know it. I spent the last 20 years writing about technology, helping other programmers write professionally, and seeking out the best software development writing for various code-centric publications including MSDN Magazine and the CodeProject daily news. I've learned what makes for engaging reading about what can be fairly dry subject matter and I'd like to share some tips and tricks for writing engaging, educational (and re-Tweetable) blog posts and articles.\n\nTo paraphrase Mad Max: You want to get on Hacker News? You talk to me.\n\nTopics for discussion:\n\n * Why write about programming? My code speaks for itself, right?\n * Focusing your big ideas into byte-sized pieces\n * Fear of writing - tips for battling writer's block\n * Intro, explanation, next steps, or why the 5-paragraph method is evil\n * Comments on the code examples\n * The editor is you're friend (really, I promise)\n * Ship it - where and when to publish\n * A BRIEF COMMENT ON READABILITY\n\nTime allowing, I may also discuss long-form writing, including books. Since many attendees may not have encountered an actual editor in the wild, I will include appropriate Q&A time to field general queries.",
  "_links": {
    "self": { "href": "/2013/sessions/writing-about-code" },
    "event": { "href": "/2013/" },
    "track": { "href": "/2013/tracks/biz-meta" },
    "space": { "href": "/2013/spaces/room-2" },
    "timePeriod": { "href": "/2013/time-periods/1130" },
    "level": { "href": "/2013/levels/100" },
    "speaker": [
      { "href": "/2013/speakers/terrence-dorsey" }
    ]
  }
}
